dracula2015/MPLABProjects/dspic33_c_OMRS_Mini_Board_Master/ecan.c
/* 
 * File:   ecan.c   
 * Author: dracula
 * Comments:
 * Revision history: EDITION 0.1 
 */

/******************************************************************************/
/* Files to Include                                                           */
/******************************************************************************/

/* Device header file */
#if defined(__XC16__)
    #include <xc.h>
#elif defined(__C30__)
    #if defined(__dsPIC33E__)
    	#include <p33Exxxx.h>
    #elif defined(__dsPIC33F__)
    	#include <p33Fxxxx.h>
    #endif
#endif

#include "ecan.h"

ECAN1MSGBUF  ecan1MsgBuf __attribute__((space(dma)));
mID canTxMessage[5];
mID canRxMessage[6];

void ecanRtrRespond(mID *message)
{
	unsigned long word0=0;
	unsigned long word1=0;
	unsigned long word2=0;
	
	/*
	Message Format: 
	Word0 : 0bUUUx xxxx xxxx xxxx
			     |____________|||
 					SID10:0   SRR IDE(bit 0)     
	Word1 : 0bUUUU xxxx xxxx xxxx
			   	   |____________|
						EID17:6
	Word2 : 0bxxxx xxx0 UUU0 xxxx
			  |_____||	     |__|
			  EID5:0 RTR   	  DLC
	
	Remote Transmission Request Bit for standard frames 
	SRR->	"0"	 Normal Message 
			"1"  Message will request remote transmission
	Substitute Remote Request Bit for extended frames 
	SRR->	should always be set to "1" as per CAN specification
	
	Extended  Identifier Bit			
	IDE-> 	"0"  Message will transmit standard identifier
	   		"1"  Message will transmit extended identifier
	
	Remote Transmission Request Bit for extended frames 
	RTR-> 	"0"  Message transmitted is a normal message
			"1"  Message transmitted is a remote message
	Don't care for standard frames 
	*/
		
	/* check to see if the message has an extended ID */
	if(message->frame_type==CAN_FRAME_EXT)
	{
		/* get the extended message id EID28..18*/		
		word0=(message->id & 0x1FFC0000) >> 16;			
		/* set the SRR and IDE bit */
		word0=word0+0x0003;
		/* the the value of EID17..6 */
		word1=(message->id & 0x0003FFC0) >> 6;
		/* get the value of EID5..0 for word 2 */
		word2=(message->id & 0x0000003F) << 10;			
	}	
	else
	{
		/* get the SID */
		word0=((message->id & 0x000007FF) << 2);	
	}
	/* check to see if the message is an RTR message */
	if(message->message_type==CAN_MSG_RTR)
	{		
		if(message->frame_type==CAN_FRAME_EXT)
			word2=word2 | 0x0200;
		else
			word0=word0 | 0x0002;	
								
		ecan1MsgBuf[message->buffer][0]=word0;
		ecan1MsgBuf[message->buffer][1]=word1;
		ecan1MsgBuf[message->buffer][2]=word2;
	}
	else
	{
		word2=word2+(message->data_length & 0x0F);
		ecan1MsgBuf[message->buffer][0]=word0;
		ecan1MsgBuf[message->buffer][1]=word1;
		ecan1MsgBuf[message->buffer][2]=word2;
		/* fill the data */
		ecan1MsgBuf[message->buffer][3]=((message->data[1] << 8) + message->data[0]);
		ecan1MsgBuf[message->buffer][4]=((message->data[3] << 8) + message->data[2]);
		ecan1MsgBuf[message->buffer][5]=((message->data[5] << 8) + message->data[4]);
		ecan1MsgBuf[message->buffer][6]=((message->data[7] << 8) + message->data[6]);
	}
}

void sendECAN(mID *message)
{
	unsigned long word0=0;
	unsigned long word1=0;
	unsigned long word2=0;
	
	/*
	Message Format: 
	Word0 : 0bUUUx xxxx xxxx xxxx
			     |____________|||
 					SID10:0   SRR IDE(bit 0)     
	Word1 : 0bUUUU xxxx xxxx xxxx
			   	   |____________|
						EID17:6
	Word2 : 0bxxxx xxx0 UUU0 xxxx
			  |_____||	     |__|
			  EID5:0 RTR   	  DLC
	
	Remote Transmission Request Bit for standard frames 
	SRR->	"0"	 Normal Message 
			"1"  Message will request remote transmission
	Substitute Remote Request Bit for extended frames 
	SRR->	should always be set to "1" as per CAN specification
	
	Extended  Identifier Bit			
	IDE-> 	"0"  Message will transmit standard identifier
	   		"1"  Message will transmit extended identifier
	
	Remote Transmission Request Bit for extended frames 
	RTR-> 	"0"  Message transmitted is a normal message
			"1"  Message transmitted is a remote message
	Don't care for standard frames 
	*/
		
	/* check to see if the message has an extended ID */
	if(message->frame_type==CAN_FRAME_EXT)
	{
		/* get the extended message id EID28..18*/		
		word0=(message->id & 0x1FFC0000) >> 16;			
		/* set the SRR and IDE bit */
		word0=word0+0x0003;
		/* the the value of EID17..6 */
		word1=(message->id & 0x0003FFC0) >> 6;
		/* get the value of EID5..0 for word 2 */
		word2=(message->id & 0x0000003F) << 10;			
	}	
	else
	{
		/* get the SID */
		word0=((message->id & 0x000007FF) << 2);	
	}
	/* check to see if the message is an RTR message */
	if(message->message_type==CAN_MSG_RTR)
	{		
		if(message->frame_type==CAN_FRAME_EXT)
			word2=word2 | 0x0200;
		else
			word0=word0 | 0x0002;	
								
		ecan1MsgBuf[message->buffer][0]=word0;
		ecan1MsgBuf[message->buffer][1]=word1;
		ecan1MsgBuf[message->buffer][2]=word2;
	}
	else
	{
		word2=word2+(message->data_length & 0x0F);
		ecan1MsgBuf[message->buffer][0]=word0;
		ecan1MsgBuf[message->buffer][1]=word1;
		ecan1MsgBuf[message->buffer][2]=word2;
		/* fill the data */
		ecan1MsgBuf[message->buffer][3]=((message->data[1] << 8) + message->data[0]);
		ecan1MsgBuf[message->buffer][4]=((message->data[3] << 8) + message->data[2]);
		ecan1MsgBuf[message->buffer][5]=((message->data[5] << 8) + message->data[4]);
		ecan1MsgBuf[message->buffer][6]=((message->data[7] << 8) + message->data[6]);
	}

    /* check to see if buffer 0 is selected */
    if(message->buffer==0)
        /* set the message for transmission */
        C1TR01CONbits.TXREQ0=1;	
	/* check to see if buffer 1 is selected */
	else if(message->buffer==1)
		/* set the message for transmission */
		C1TR01CONbits.TXREQ1=1;				
	/* check to see if buffer 2 is selected */
	else if(message->buffer==2)
		/* set the message for transmission */
		C1TR23CONbits.TXREQ2=1;
    /* check to see if buffer 6 is selected */
	else if(message->buffer==6)
        /* set the message for transmission */
        C1TR67CONbits.TXREQ6=1;	
	/* check to see if buffer 7 is selected */
	else if(message->buffer==7)
		/* set the message for transmission */
		C1TR67CONbits.TXREQ7=1;
    else;
}

