dracula2015/MPLABProjects/dspic33_c_OMRS_Mini_Board_Master/ecan.c
/******************************************************************************
*                                                                             
*    Function:			rxECAN
*    Description:       moves the message from the DMA memory to RAM
*                                                                             
*    Arguments:			*message: a pointer to the message structure in RAM 
*						that will store the message. 
*	 Author:            Jatinder Gharoo                                                      
*	                                                                 
*                                                                              
******************************************************************************/
void rxECAN(mID *message)
{
	unsigned int ide=0;
	unsigned int rtr=0;
	unsigned long id=0;
			
	/*
	Standard Message Format: 
	Word0 : 0bUUUx xxxx xxxx xxxx
			     |____________|||
 					SID10:0   SRR IDE(bit 0)     
	Word1 : 0bUUUU xxxx xxxx xxxx
			   	   |____________|
						EID17:6
	Word2 : 0bxxxx xxx0 UUU0 xxxx
			  |_____||	     |__|
			  EID5:0 RTR   	  DLC
	word3-word6: data bytes
	word7: filter hit code bits
	
	Remote Transmission Request Bit for standard frames 
	SRR->	"0"	 Normal Message 
			"1"  Message will request remote transmission
	Substitute Remote Request Bit for extended frames 
	SRR->	should always be set to "1" as per CAN specification
	
	Extended  Identifier Bit			
	IDE-> 	"0"  Message will transmit standard identifier
	   		"1"  Message will transmit extended identifier
	
	Remote Transmission Request Bit for extended frames 
	RTR-> 	"0"  Message transmitted is a normal message
			"1"  Message transmitted is a remote message
	Don't care for standard frames 
	*/
		
	/* read word 0 to see the message type */
	ide=ecan1MsgBuf[message->buffer][0] & 0x0001;			
	
	/* check to see what type of message it is */
	/* message is standard identifier */
	if(ide==0)
	{
		message->id=(ecan1MsgBuf[message->buffer][0] & 0x1FFC) >> 2;		
		message->frame_type=CAN_FRAME_STD;
		rtr=ecan1MsgBuf[message->buffer][0] & 0x0002;
	}
	/* mesage is extended identifier */
	else
	{
		id=ecan1MsgBuf[message->buffer][0] & 0x1FFC;		
		message->id=id << 16;
		id=ecan1MsgBuf[message->buffer][1] & 0x0FFF;
		message->id=message->id+(id << 6);
		id=(ecan1MsgBuf[message->buffer][2] & 0xFC00) >> 10;
		message->id=message->id+id;		
		message->frame_type=CAN_FRAME_EXT;
		rtr=ecan1MsgBuf[message->buffer][2] & 0x0200;
	}
	/* check to see what type of message it is */
	/* RTR message */
	if(rtr==1)
	{
		message->message_type=CAN_MSG_RTR;	
	}
	/* normal message */
	else
	{
		message->message_type=CAN_MSG_DATA;
		message->data[0]=(unsigned char)ecan1MsgBuf[message->buffer][3];
		message->data[1]=(unsigned char)((ecan1MsgBuf[message->buffer][3] & 0xFF00) >> 8);
		message->data[2]=(unsigned char)ecan1MsgBuf[message->buffer][4];
		message->data[3]=(unsigned char)((ecan1MsgBuf[message->buffer][4] & 0xFF00) >> 8);
		message->data[4]=(unsigned char)ecan1MsgBuf[message->buffer][5];
		message->data[5]=(unsigned char)((ecan1MsgBuf[message->buffer][5] & 0xFF00) >> 8);
		message->data[6]=(unsigned char)ecan1MsgBuf[message->buffer][6];
		message->data[7]=(unsigned char)((ecan1MsgBuf[message->buffer][6] & 0xFF00) >> 8);
		message->data_length=(unsigned char)(ecan1MsgBuf[message->buffer][2] & 0x000F);
	}
	clearRxFlags(message->buffer);	
}

/******************************************************************************
*                                                                             
*    Function:			clearRxFlags
*    Description:       clears the rxfull flag after the message is read
*                                                                             
*    Arguments:			buffer number to clear 
*	 Author:            Jatinder Gharoo                                                      
*	                                                                 
*                                                                              
******************************************************************************/
void clearRxFlags(unsigned char buffer_number)
{
    /* check to see if buffer 3 is full */
	if((C1RXFUL1bits.RXFUL3) && (buffer_number==3))
		/* clear flag */
    {C1RXFUL1bits.RXFUL3=0;}
	/* check to see if buffer 4 is full */
	else if((C1RXFUL1bits.RXFUL4) && (buffer_number==4))
		/* clear flag */
    {C1RXFUL1bits.RXFUL4=0;}				
	/* check to see if buffer 5 is full */
	else if((C1RXFUL1bits.RXFUL5) && (buffer_number==5))
		/* clear flag */
    {C1RXFUL1bits.RXFUL5=0;}
    /* check to see if buffer 8 is full */
	else if((C1RXFUL1bits.RXFUL8) && (buffer_number==8))
		/* clear flag */
    {C1RXFUL1bits.RXFUL8=0;}		
	/* check to see if buffer 9 is full */
	else if((C1RXFUL1bits.RXFUL9) && (buffer_number==9))
		/* clear flag */
    {C1RXFUL1bits.RXFUL9=0;}				
	/* check to see if buffer 10 is full */
	else if((C1RXFUL1bits.RXFUL10) && (buffer_number==10))
		/* clear flag */
	{C1RXFUL1bits.RXFUL10=0;}
    else;

}

/******************************************************************************
*                                                                             
*    Function:			ECANInit
*    Description:       Initialises the ECAN module                                                        
*                                                                             
*    Arguments:			none 
*	 Author:            Jatinder Gharoo                                                      
*	                                                                 
*                                                                              
******************************************************************************/
void ECANInit (void)
{

	/* put the module in configuration mode */
	C1CTRL1bits.REQOP=4;
	while(C1CTRL1bits.OPMODE != 4);
	/*
	Bit Time = (Sync Segment + Propagation Delay + Phase Segment 1 + Phase Segment 2)=20*TQ
	Phase Segment 1 = 8TQ
	Phase Segment 2 = 6TQ
	Propagation Delay = 5TQ
	Sync Segment = 1TQ
	CiCFG1<BRP> = ((FCAN/(2*NTQ*BITRATE))-1)
	BIT RATE OF 1Mbps
	*/	
	/* Phase Segment 1 time is 8 TQ */
	C1CFG2bits.SEG1PH=0x7;
	/* Phase Segment 2 time is set to be programmable */
	C1CFG2bits.SEG2PHTS = 0x1;
	/* Phase Segment 2 time is 6 TQ */
	C1CFG2bits.SEG2PH = 0x5;
	/* Propagation Segment time is 5 TQ */
	C1CFG2bits.PRSEG = 0x4;
	/* Bus line is sampled three times at the sample point */
	C1CFG2bits.SAM = 0x1;
    /* Synchronization Jump Width set to 4 TQ */
	C1CFG1bits.SJW = 0x3;
    /* Baud Rate Prescaler bits set to 1:1, i.e., TQ = (2*1*1)/ FCAN */
	C1CFG1bits.BRP = BRP_VAL;
//	/* 8 CAN Messages to be buffered in DMA RAM */	
//	C1FCTRLbits.DMABS=0b10;
    /* 32 CAN Messages to be buffered in DMA RAM */	
	C1FCTRLbits.DMABS=0b110;
	
	/* Filter configuration */
	/* Enable window to access the filter configuration registers */
	C1CTRL1bits.WIN=0b1;
    
	/* select acceptance mask 0 filter 0 buffer 3 */
	C1FMSKSEL1bits.F0MSK=0;
	/* configure accpetence mask 0 - match the id in filter 0 
	setup the mask to check every bit of the extended message, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0xFFFF) 
	will write the register C1RXM1EID to include extended 
	message id bits EID0 to EID15 in filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1FFF) 
	will write the register C1RXM1SID to include extended 
	message id bits EID16 to EID28 in filter comparison. 	
	*/ 	
    C1RXM0EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM0SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure accpetence filter 0 
	configure accpetence filter 0 - accept only XTD ID 0x12345677 
	setup the filter to accept only extended message 0x12345677, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0x5677) 
	will write the register C1RXF1EID to include extended 
	message id bits EID0 to EID15 when doing filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1234) 
	will write the register C1RXF1SID to include extended 
	message id bits EID16 to EID28 when doing filter comparison. 	
	*/ 	
    C1RXF0EID=CAN_FILTERMASK2REG_EID0(0x5677);
	C1RXF0SID=CAN_FILTERMASK2REG_EID1(0x1234);
	/* set filter to check for extended ID and accept extended id only */
	C1RXM0SID=CAN_SETMIDE(C1RXM0SID);
	C1RXF0SID=CAN_FILTERXTD(C1RXF0SID);	
	/* acceptance filter to use buffer 3 for incoming messages */
	C1BUFPNT1bits.F0BP=0b0011;
	/* enable filter 0 */
	C1FEN1bits.FLTEN0=1;
	
