dracula2015/MPLABProjects/dspic33_c_OMRS_Mini_Board_Master/ecan.c
	/* select acceptance mask 1 filter 1 and buffer 4 */
	C1FMSKSEL1bits.F1MSK=0b01;
	/* configure accpetence mask 1 - match id in filter 1 	
	setup the mask to check every bit of the extended message, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0xFFFF) 
	will write the register C1RXM1EID to include extended 
	message id bits EID0 to EID15 in filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1FFF) 
	will write the register C1RXM1SID to include extended 
	message id bits EID16 to EID28 in filter comparison. 	
	*/ 			
	C1RXM1EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM1SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure acceptance filter 1 
	configure accpetence filter 1 - accept only XTD ID 0x12345678 
	setup the filter to accept only extended message 0x12345678, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0x5678) 
	will write the register C1RXF1EID to include extended 
	message id bits EID0 to EID15 when doing filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1234) 
	will write the register C1RXF1SID to include extended 
	message id bits EID16 to EID28 when doing filter comparison. 	
	*/ 
	C1RXF1EID=CAN_FILTERMASK2REG_EID0(0x5678);
	C1RXF1SID=CAN_FILTERMASK2REG_EID1(0x1234);		
	/* filter to check for extended ID only */
	C1RXM1SID=CAN_SETMIDE(C1RXM1SID);
	C1RXF1SID=CAN_FILTERXTD(C1RXF1SID);
	/* acceptance filter to use buffer 4 for incoming messages */
	C1BUFPNT1bits.F1BP=0b0100;
	/* enable filter 1 */
	C1FEN1bits.FLTEN1=1;
	
	/* select acceptance mask 2 filter 2 and buffer 5 */
	C1FMSKSEL1bits.F2MSK=0b10;	
    /* configure accpetence mask 2 - match id in filter 2 	
	setup the mask to check every bit of the extended message, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0xFFFF) 
	will write the register C1RXM1EID to include extended 
	message id bits EID0 to EID15 in filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1FFF) 
	will write the register C1RXM1SID to include extended 
	message id bits EID16 to EID28 in filter comparison. 	
	*/ 			
	C1RXM2EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM2SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure acceptance filter 2 
	configure accpetence filter 2 - accept only XTD ID 0x12345679 
	setup the filter to accept only extended message 0x12345679, 
	the macro when called as CAN_FILTERMASK2REG_EID0(0x5679) 
	will write the register C1RXF1EID to include extended 
	message id bits EID0 to EID15 when doing filter comparison. 
	the macro when called as CAN_FILTERMASK2REG_EID1(0x1234) 
	will write the register C1RXF1SID to include extended 
	message id bits EID16 to EID28 when doing filter comparison. 	
	*/ 
	C1RXF2EID=CAN_FILTERMASK2REG_EID0(0x5679);
	C1RXF2SID=CAN_FILTERMASK2REG_EID1(0x1234);		
	/* filter to check for extended ID only */
    C1RXM2SID=CAN_SETMIDE(C1RXM2SID);	
	C1RXF2SID=CAN_FILTERXTD(C1RXF2SID);
	/* acceptance filter to use buffer 5 for incoming messages */
	C1BUFPNT1bits.F2BP=0b0101;
	/* enable filter 2 */
	C1FEN1bits.FLTEN2=1;
	
    /* select acceptance mask 0 filter 3 buffer 8 */
	C1FMSKSEL1bits.F3MSK=0;
	/* configure accpetence mask 0 - match the id in filter 3 */ 	
    C1RXM0EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM0SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure accpetence filter 3 - accept only XTD ID 0x12345657 */ 	
    C1RXF3EID=CAN_FILTERMASK2REG_EID0(0x5657);
	C1RXF3SID=CAN_FILTERMASK2REG_EID1(0x1234);
	/* set filter to check for extended ID and accept extended id only */
	C1RXM0SID=CAN_SETMIDE(C1RXM0SID);
	C1RXF3SID=CAN_FILTERXTD(C1RXF3SID);	
	/* acceptance filter to use buffer 8 for incoming messages */
	C1BUFPNT1bits.F3BP=0b1000;
	/* enable filter 3 */
	C1FEN1bits.FLTEN3=1;
    
    /* select acceptance mask 1 filter 4 buffer 9 */
	C1FMSKSEL1bits.F4MSK=1;
	/* configure accpetence mask 1 - match the id in filter 4 */ 	
    C1RXM1EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM1SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure accpetence filter 4 - accept only XTD ID 0x12345658 */ 	
    C1RXF4EID=CAN_FILTERMASK2REG_EID0(0x5658);
	C1RXF4SID=CAN_FILTERMASK2REG_EID1(0x1234);
	/* set filter to check for extended ID and accept extended id only */
	C1RXM1SID=CAN_SETMIDE(C1RXM1SID);
	C1RXF4SID=CAN_FILTERXTD(C1RXF4SID);	
	/* acceptance filter to use buffer 9 for incoming messages */
	C1BUFPNT2bits.F4BP=0b1001;
	/* enable filter 4 */
	C1FEN1bits.FLTEN4=1;

    /* select acceptance mask 2 filter 5 buffer 10 */
	C1FMSKSEL1bits.F5MSK=2;
	/* configure accpetence mask 2 - match the id in filter 5 */ 	
    C1RXM2EID=CAN_FILTERMASK2REG_EID0(0xFFFF);
	C1RXM2SID=CAN_FILTERMASK2REG_EID1(0x1FFF);
	/* configure accpetence filter 5 - accept only XTD ID 0x12345659 */ 	
    C1RXF5EID=CAN_FILTERMASK2REG_EID0(0x5659);
	C1RXF5SID=CAN_FILTERMASK2REG_EID1(0x1234);
	/* set filter to check for extended ID and accept extended id only */
	C1RXM2SID=CAN_SETMIDE(C1RXM2SID);
	C1RXF5SID=CAN_FILTERXTD(C1RXF5SID);	
	/* acceptance filter to use buffer 10 for incoming messages */
	C1BUFPNT2bits.F5BP=0b1010;
	/* enable filter 5 */
	C1FEN1bits.FLTEN5=1;
    
	/* clear window bit to access ECAN control registers */
	C1CTRL1bits.WIN=0;
		
	/* put the module in normal mode */
	C1CTRL1bits.REQOP=0;
	while(C1CTRL1bits.OPMODE != 0);	
	
	/* clear the buffer and overflow flags */
	C1RXFUL1=C1RXFUL2=C1RXOVF1=C1RXOVF2=0x0000;
	/* ECAN1, Buffer 0 is a Transmit Buffer */
	C1TR01CONbits.TXEN0=1;			
	/* ECAN1, Buffer 1 is a Transmit Buffer */
	C1TR01CONbits.TXEN1=1;	
	/* ECAN1, Buffer 2 is a Transmit Buffer */
	C1TR23CONbits.TXEN2=1;	
    
	/* ECAN1, Buffer 3 is a Receive Buffer */
	C1TR23CONbits.TXEN3=0;
    /* ECAN1, Buffer 4 is a Receive Buffer */
	C1TR45CONbits.TXEN4=0;
    /* ECAN1, Buffer 5 is a Receive Buffer */
	C1TR45CONbits.TXEN5=0;	
    
    /* ECAN1, Buffer 6 is a Transmit Buffer */
	C1TR67CONbits.TXEN6=1;			
	/* ECAN1, Buffer 7 is a Transmit Buffer */
	C1TR67CONbits.TXEN7=1;	
    
	/* Message Buffer 0 Priority Level */
	C1TR01CONbits.TX0PRI=0b11; 	
    /* Message Buffer 1 Priority Level */
	C1TR01CONbits.TX1PRI=0b11;
    /* Message Buffer 2 Priority Level */
	C1TR23CONbits.TX2PRI=0b11;	
    
    /* Message Buffer 0 Priority Level */
	C1TR67CONbits.TX6PRI=0b11; 	
    /* Message Buffer 1 Priority Level */
	C1TR67CONbits.TX7PRI=0b11;
		
	/* configure the device to interrupt on the receive buffer full flag */
	/* clear the buffer full flags */
	C1INTFbits.RBIF=0;
    /*ECAN1 Interrupt Priority*/
    IPC8bits.C1IP = 0b101;
    /*ECAN1 Receive Interrupt Priority*/
    IPC8bits.C1RXIP = 0b101;
    /*ECAN1 Transmit Interrupt Priority*/
    IPC17bits.C1TXIP = 0b101;
    /* Enable ECAN1 Interrupt */     	
	IEC2bits.C1IE=1;	
	/* enable Transmit interrupt */
	C1INTEbits.TBIE=1;
	/* Enable Receive interrupt */
	C1INTEbits.RBIE=1;
}

