dracula2015/MPLABProjects/dspic33_c_OMRS_Mini_Board_Master/ecan.c
/******************************************************************************
*                                                                             
*    Function:			DMAInit
*    Description:       Initialises the DMA to be used with ECAN module                                                        
*                       Channel 0 of the DMA is configured to Tx ECAN messages
* 						of ECAN module 1. 
*						Channel 2 is uconfigured to Rx ECAN messages of module 1.                                                      
*    Arguments:			
*	 Author:            Jatinder Gharoo                                                      
*	                                                                 
*                                                                              
******************************************************************************/
void DMAInit(void)
{
//	/* initialise the DMA channel 0 for ECAN Tx */
//	/* clear the collission flags */
//	DMACS0=0;	
//    /* setup channel 0 for peripheral indirect addressing mode 
//    normal operation, word operation and select as Tx to peripheral */
//    DMA0CON=0x2020; 
//    /* setup the address of the peripheral ECAN1 (C1TXD) */ 
//	DMA0PAD=0x0442;
    
    /* Data Transfer Size: Word Transfer Mode */
    DMA0CONbits.SIZE = 0x0;
    /* Data Transfer Direction: DMA RAM to Peripheral */
    DMA0CONbits.DIR = 0x1;
    /* DMA Addressing Mode: Peripheral Indirect Addressing mode */
    DMA0CONbits.AMODE = 0x2;
    /* Operating Mode: Continuous, Ping-Pong modes disabled */
    DMA0CONbits.MODE = 0x0;
    /* automatic DMA Tx initiation by DMA request */
	DMA0REQ=0x0046;	
	/* Set the data block transfer size of 8 */
 	DMA0CNT=7;
    /* Peripheral Address: ECAN1 Transmit Register */
    DMA0PAD = &C1TXD;
	/* DPSRAM atart adddress offset value */ 
//	DMA0STA=__builtin_dmaoffset(ecan1msgBuf);
    DMA0STA=__builtin_dmaoffset(&ecan1MsgBuf);	
	/* enable the channel */
	DMA0CONbits.CHEN=1;
	
//	/* initialise the DMA channel 2 for ECAN Rx */
//	/* clear the collission flags */
//	DMACS0=0;
//    /* setup channel 2 for peripheral indirect addressing mode 
//    normal operation, word operation and select as Rx to peripheral */
//    DMA2CON=0x0020;
//    /* setup the address of the peripheral ECAN1 (C1RXD) */ 
//	DMA2PAD=0x0440;	
    /* Data Transfer Size: Word Transfer Mode */
    DMA2CONbits.SIZE = 0x0;
    /* Data Transfer Direction: Peripheral to DMA RAM */
    DMA2CONbits.DIR = 0x0;
    /* DMA Addressing Mode: Peripheral Indirect Addressing mode */
    DMA2CONbits.AMODE = 0x2;
    /* Operating Mode: Continuous, Ping-Pong modes disabled */
    DMA2CONbits.MODE = 0x0;
    /* Assign ECAN1 Receive event for DMA Channel 2 */
    /* automatic DMA Rx initiation by DMA request */
	DMA2REQ=0x0022;
 	/* Set the data block transfer size of 8 */
 	DMA2CNT=7;
    /* Peripheral Address: ECAN1 Receive Register */
    DMA2PAD = &C1RXD;	
	/* DPSRAM atart adddress offset value */ 
	DMA2STA=__builtin_dmaoffset(&ecan1MsgBuf);	
	/* enable the channel */
	DMA2CONbits.CHEN=1;
}	 
